n=int(input())
dp=[[0]*10 for _ in range(n+1)]
for i in range(10):
    dp[1][i]=1 # 한자리수면 모두 오르막 수
if n>=2:
    for i in range(10):
        dp[2][i]=i+1 # 한자리수면 모두 오르막 수
for i in range(3,n+1): #세자리수부터 n자리수까지
    for j in range(10):
        if j==0:
            dp[i][j]=1
        else:
            dp[i][j]=sum(dp[i-1][:j+1])

print(sum(dp[n])%10007)

#두자리수: 뒷자리 수 i에 따라 오르막수 i개
#세자리수: 뒷자리수 0이면 앞에 아무것도 못옴=0
# 뒷자리수 1이면 dp[3][1]=dp[2][0]+dp[2][1]=1+2=3
# 뒷자리수 2이면 dp[3][2]=dp[2][0]+dp[2][1]+dp[2][2]=1+2+3=6
# 뒷자리수 3이면 dp[3][3]=dp[2][2]+dp[2][3]=3+4
# dp[i][j]=dp[i-1][j-1]+dp[i-1][j]
#네자리수 1 dp[4][1]=dp[3][0]+dp[3][1]=1
#네자리수 2 dp[4][2]=dp[3][1]+dp[3][2]=1+3=4